In [2]:
import numpy as np
import pandas as pd

In [3]:
pd.set_option('display.max_rows', None)

In [4]:
df = pd.read_csv('export_format4.csv')

In [5]:
df.head()

,employer,period_begin,period_end,post_date,salary,sheltered,unsheltered,total
0,Orleans,1/1/2002,1/31/2002,1/29/2002,262.62,0.0,18.38,18.38
1,Orleans,2/1/2002,2/28/2002,2/22/2002,525.24,0.0,36.76,36.76
2,Orleans,3/1/2002,3/31/2002,3/27/2002,525.24,0.0,36.76,36.76
3,Orleans,4/1/2002,4/30/2002,4/26/2002,525.24,0.0,36.76,36.76
4,Orleans,5/1/2002,5/31/2002,6/11/2002,"1,021.93",0.0,71.53,71.53

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 582 entries, 0 to 581
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   employer      582 non-null    object
 1   period_begin  582 non-null    object
 2   period_end    582 non-null    object
 3   post_date     582 non-null    object
 4   salary        582 non-null    object
 5   sheltered     582 non-null    float64
 6   unsheltered   582 non-null    float64
 7   total         582 non-null    float64
dtypes: float64(3), object(5)
memory usage: 36.5+ KB

In [8]:
df['salary'] = pd.to_numeric(df['salary'])

ValueError: Unable to parse string "1,021.93" at position 4

In [9]:
df = df.groupby('period_end').sum()

C:\Users\User\AppData\Local\Temp\ipykernel_9404\4198786321.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df = df.groupby('period_end').sum()

In [10]:
df.head()

            sheltered  unsheltered   total
period_end
1/31/2002        0.00        36.75   36.75
1/31/2003        0.00        89.20   89.20
1/31/2004        0.00       102.12  102.12
1/31/2005      113.80         0.00  113.80
1/31/2006      106.44         0.00  106.44

In [16]:
df = df.sort_values(by='period_end', key=pd.to_datetime)

In [ ]:
help(df.sort_values)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 247 entries, 1/31/2002 to 4/30/2022
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sheltered    247 non-null    float64
 1   unsheltered  247 non-null    float64
 2   total        247 non-null    float64
dtypes: float64(3)
memory usage: 7.7+ KB

In [34]:
df['rolling_60'] = df['salary'].rolling(60).mean()

In [35]:
df.tail()

             salary  sheltered  unsheltered   total   rolling_60
period_end
9/30/2017   7623.59     533.66          0.0  533.66  3360.969000
9/30/2018   6231.18     436.18          0.0  436.18  3339.196500
9/30/2019   6386.66     447.06          0.0  447.06  3330.943833
9/30/2020   6711.89     469.84          0.0  469.84  3294.497000
9/30/2021   7056.93     493.98          0.0  493.98  3394.736333

In [36]:
df['salary'].info()

<class 'pandas.core.series.Series'>
Index: 179 entries, 1/31/1989 to 9/30/2021
Series name: salary
Non-Null Count  Dtype
--------------  -----
179 non-null    float64
dtypes: float64(1)
memory usage: 2.8+ KB

In [113]:
def salary_cap(rolling_60):
    for i in len(rolling_60):
        for num[i] in rolling_60:
            # well............actually this isn't going to work at all BECAUSE
            # i need this to happen within the .rolling() function.
            # if called on the rolling_60 column, then i'm just implementing the cap on average to average, not within the year to year

SyntaxError: invalid syntax (2300947213.py, line 1)

In [46]:
def int_convert(notnum):
    convert = []
    for num in notnum:
        convert += int(num)
    return convert